In [1]:
import sqlite3

In [2]:
import csv

In [3]:
conn=sqlite3.connect('IMDB.db')
cursor=conn.cursor()


# Create first table for file1.csv
cursor.execute('CREATE TABLE table1(serial_number INTEGER PRIMARY KEY,movie_name TEXT,year INTEGER,director_names TEXT,duration REAL,ratings REAL,metascore REAL);')

# Create the second table for file2.csv
cursor.execute('CREATE TABLE table2(movie_name TEXT,gross_collection REAL,stars_names TEXT,genre TEXT,votes INTEGER);')

conn.commit()

In [12]:
# import data from file1.csv
try:

  with open('/content/File_1.csv','r') as file_1:
    csv_data1=csv.reader(file_1)
    next(csv_data1)
    for row in csv_data1:
      cursor.execute("INSERT INTO table1(serial_number,movie_name,year,director_names,duration,ratings,metascore) VALUES(?,?,?,?,?,?,?)",(row[0],row[1],row[2],row[3],row[4],row[5],row[6]))


# import data from file2.csv
  with open('/content/File_2.csv','r') as file_2:
    csv_data2=csv.reader(file_2)
    next(csv_data2)
    for row in csv_data2:
      cursor.execute("INSERT INTO table2(movie_name,gross_collection,stars_names,genre,votes) VALUES(?,?,?,?,?)",(row[0],row[1],row[2],row[3],row[4]))

# commit the changes
  conn.commit()

except Exception as e:
    print("Error:", str(e))
    conn.rollback()

Error: UNIQUE constraint failed: table1.serial_number

In [14]:
# Execute the sql query to fetch the movies created by directors Christopher and Matt Reeves.
cursor.execute("SELECT t1.*,t2.* FROM table1 AS t1 JOIN table2 AS t2 ON t1.director_names WHERE t1.director_names IN ('Christopher','Matt Reeves')")
movies_by_directors=cursor.fetchall()

print("Movies created by directors Christopher and Matt Reeves:")
for row in movies_by_directors:
  print(row)

Movies created by directors Christopher and Matt Reeves:

In [16]:
# Display all the details of movies with a duration of 140 minutes to 190 minutes
cursor.execute("SELECT t1.*,t2.* FROM table1 AS t1 JOIN table2 AS t2 ON t1.movie_name=t2.movie_name WHERE (t1.duration>=140 AND t1.duration<=190)")
movies_within_duration=cursor.fetchall()

print("Movies with a duration between 140 and 190 minutes:")
for row in movies_within_duration:
  print(row)

Movies with a duration between 140 and 190 minutes:

In [22]:
# Display all details of movies with ratings above 7 in ascending order
cursor.execute("SELECT t1.* FROM table1 AS t1  WHERE t1.ratings>7 ORDER BY t1.ratings ASC")
movies_above_7_ratings=cursor.fetchall()

print("Movies with ratings above 7 in ascending order:")
for row in movies_above_7_ratings:
  print(row)

Movies with ratings above 7 in ascending order:

In [24]:
# Display all movie names in descending order.
cursor.execute("SELECT movie_name FROM table1 UNION SELECT movie_name FROM table2 ORDER BY movie_name DESC")
all_movie_names=cursor.fetchall()

print("All movie names in descending order:")
for row in all_movie_names:
  print(row[0])

All movie names in descending order:

In [27]:
# Display movie name starts with ‘P’ and their rating is greater than 7
cursor.execute("SELECT movie_name FROM table1 WHERE movie_name LIKE 'P%' AND ratings>7 UNION SELECT movie_name FROM table2 WHERE movie_name LIKE 'P%'")
movies_with_p_and_high_ratings=cursor.fetchall()

print("Movie names that start with 'P' and have ratings greater than 7:")
for row in movies_with_p_and_high_ratings:
  print(row[0])

Movie names that start with 'P' and have ratings greater than 7:

In [32]:
from IPython.display import display

In [33]:
# Display all movie names with star Arnold Schwarzenegger in ascending order
cursor.execute("SELECT movie_name FROM table1 UNION SELECT movie_name FROM table2 WHERE stars_names LIKE '%Arnold Schwarzenegger%' ORDER BY movie_name ASC")
movies_with_arnold=cursor.fetchall()

print("All movie names with star Arnold Schwarzenegger in ascending order:")
for row in movies_with_arnold:
  display(row[0])

All movie names with star Arnold Schwarzenegger in ascending order:

In [36]:
# Display all details of the movie with the highest number of votes
cursor.execute("SELECT * FROM table2 ORDER BY votes DESC LIMIT 1")
movie_with_highest_votes=cursor.fetchall()

print("Details  of the movie with the highest number of votes:")
for row in movie_with_highest_votes:
  print(row)

Details  of the movie with the highest number of votes:

In [38]:
# Display movie names with gross collections in descending order
cursor.execute("SELECT movie_name FROM table2 ORDER BY gross_collection DESC")
movies_by_gross_collection=cursor.fetchall()

print("Movie names with gross collection in descending order:")
for row in movies_by_gross_collection:
  print(row[0])

Movie names with gross collection in descending order:

In [39]:
# Display the gross collection of movies with the star Arnold
cursor.execute("SELECT movie_name,gross_collection FROM table2 WHERE stars_names LIKE '%Arnold Schwarzenegger%'")
movies_with_arnold_gross=cursor.fetchall()

print("Gross collection of movies with star Arnold Schwarzenegger:")
for row in movies_with_arnold_gross:
  print(f"{row[0]}:{row[1]}")

Gross collection of movies with star Arnold Schwarzenegger:

In [40]:
# Display all details of movies with comedy and action genres
cursor.execute("SELECT * FROM table2 WHERE genre IN ('comedy','action')")
comedy_action_movies=cursor.fetchall()

print("Details of movies with comedy and action genres:")
for row in comedy_action_movies:
  print(row)

Details of movies with comedy and action genres:

In [41]:
 # Display all details from both tables where movie names are the same
 cursor.execute("SELECT t1.*,t2.* FROM table1 AS t1 INNER JOIN table2 AS t2 ON t1.movie_name=t2.movie_name")
 movies_with_same_name=cursor.fetchall()

 print("Details of movies with the same names:")
 for row in movies_with_same_name:
  print(row)

Details of movies with the same names:

In [45]:
# Display all movie names, Director, ratings, and gross collection where the genre is action
cursor.execute("SELECT movie_name,director_names,ratings FROM table1  UNION SELECT movie_name,gross_collection,NULL FROM table2 WHERE genre='action'")
action_movies_details=cursor.fetchall()

print("Details of movies with the genre 'action':")
for row in action_movies_details:
  movie_name,director_names,ratings,gross_collection=row
  print(f"Movie Name:{movie_name},Director:{director_names},Ratings:{ratings},Gross Collection:{gross_collection}")

Details of movies with the genre 'action':

In [47]:
# Display all details from both tables with the highest gross collection
cursor.execute("SELECT * FROM table2 ORDER BY gross_collection DESC LIMIT 1")
highest_gross_movie=cursor.fetchall()

print("Details of the movie with the highest gross collection:")
for row in highest_gross_movie:
  print(row)

Details of the movie with the highest gross collection:

In [48]:
# Display all details from both tables with the highest ratings
cursor.execute("SELECT * FROM table1 ORDER BY ratings DESC LIMIT 1")
highest_rated_movie=cursor.fetchall()

print("Details of the movie with the highest ratings:")
for row in highest_rated_movie:
  print(row)

Details of the movie with the highest ratings:

In [50]:
# Display all details from both tables with the lowest gross collection and lowest ratings
cursor.execute("SELECT * FROM table1 ORDER BY ratings ASC LIMIT 1")
cursor.execute("SELECT * FROM table2 ORDER BY gross_collection ASC")
lowest_gross_lowest_ratings_movie=cursor.fetchall()

print("Details of the movie with the lowest gross collection  and lowest ratings:")
for row in lowest_gross_lowest_ratings_movie:
  print(row)

Details of the movie with the lowest gross collection  and lowest ratings:

# Pandas SQL

In [51]:
import pandas as pd
!pip install -U pandasql
import pandasql as ps

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
  Preparing metadata (setup.py) ... done
Requirement already satisfied: numpy in /usr/local/lib/python3.10/dist-packages (from pandasql) (1.22.4)
Requirement already satisfied: pandas in /usr/local/lib/python3.10/dist-packages (from pandasql) (1.5.3)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.10/dist-packages (from pandasql) (2.0.19)
Requirement already satisfied: python-dateutil>=2.8.1 in /usr/local/lib/python3.10/dist-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.10/dist-packages (from pandas->pandasql) (2022.7.1)
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy->pandasql) (4.7.1)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy->pandasql) (2.0.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.10/dist-packages (from python-dateutil>=2.8.1->pandas->pandasql) (1.16.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py) ... done
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26771 sha256=8f1c28177f30a5b0c10bb36c650debf66905dfb485fbed224f9fcdbca77723ea
  Stored in directory: /root/.cache/pip/wheels/e9/bc/3a/8434bdcccf5779e72894a9b24fecbdcaf97940607eaf4bcdf9
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [52]:
df1=pd.read_csv('/content/File_1.csv')
df2=pd.read_csv('/content/File_2.csv')

In [ ]:
# Display all the details of movies created by directors Christopher and Matt Reeves.
query1="SELECT * FROM df1 WHERE director_names IN ('Christopher','Matt Reeves') UNION SELECT * FROM df2 WHERE director_names IN ('Christopher','Matt Reeves')"
result1=ps.sqldf(query1)
print("Query 1:")
print(result1)


# Display all the details of movies with a duration of 140 minutes to 190 minutes
query2="SELECT * FROM df1 WHERE duration BETWEEN 140 AND 190 UNION SELECT * FROM df2 WHERE duration BETWEEN 140 AND 190"
result2=ps.sqldf(query2)
print("\nQuery 2:")
print(result2)

# Display all details of movies with ratings above 7 in ascending order
query3="SELECT * FROM df1 WHERE ratings>7 UNION SELECT * FROM df2 WHERE ratings>7 ORDER BY ratings ASC"
result3=ps.sqldf(query3)
print("\nQuery 3:")
print(result3)

# Display all movie names in descending order
query4="SELECT movie_name FROM df1 UNION SELECT movie_name FROM df2 ORDER BY movie_name DESC"
result4=ps.sqldf(query4)
print("\nQuery 4:")
print(result4)

# Display movie name starts with ‘P’ and their rating is greater than 7
query5="SELECT movie_name FROM df1 WHERE movie_name LIKE 'P%' AND ratings>7 UNION SELECT movie_name FROM df2 WHERE movie_name LIKE 'P%' AND ratings>7"
result5=ps.sqldf(query5)
print("\nQuery 5:")
print(result5)

# Display all movie names with star Arnold Schwarzenegger in ascending order
query6="SELECT movie_name FROM df1 WHERE stars_names LIKE '%Arnold Schwarzenegger%' UNION SELECT movie_name FROM df2 WHERE stars_names LIKE '%Arnold Schwarzenegger%' ORDER BY movie_name ASC"
result6=ps.sqldf(query6)
print("\nQuery 6:")
print(result6)

# Display all details of the movie with the highest number of votes
query7="SELECT * FROM (SELECT * FROM df1 UNION SELECT * FROM df2) ORDER BY votes DESC LIMIT 1"
result7=ps.sqldf(query7)
print("\nQuery 7:")
print(result7)

# Display movie names with gross collections in descending order
query8="SELECT movie_name,gross_collection FROM (SELECT * FROM df1 UNION SELECT * FROM df2) ORDER BY gross_collection DESC"
result8=ps.sqldf(query8)
print("\nQuery 8:")
print(result8)

# Display the gross collection of movies with the star Arnold
query9="SELECT gross_collection FROM df1 WHERE stars_names LIKE '%Arnold%' UNION SELECT gross_collection FROM df2 WHERE stars_names LIKE '%Arnold%'"
result9=ps.sqldf(query9)
print("\nQuery 9:")
print(result9)

# Display all details of movies with comedy and action genres
query10="SELECT * FROM df1 WHERE genre IN ('comedy','action') UNION SELECT * FROM df2 WHERE genre IN ('comedy','action')"
result10=ps.sqldf(query10)
print("\nQuery 10:")
print(result10)

# Display all details from both tables where movie names are the same
query11="SELECT t1.*,t2.* FROM df1 AS t1 INNER JOIN df2 AS t2 ON t1.movie_name=t2.movie_name"
result11=ps.sqldf(query11)
print("\nQuery 11:")
print(result11)

# Display all movie names, Director, ratings, and gross collection where the genre is action
query12="SELECT movie_name,director_names,ratings,gross_collection FROM df1 WHERE genre='action' UNION SELECT movie_name,director_names,ratings,gross_collection FROM df2 WHERE genre='action'"
result12=ps.sqldf(query12)
print("\nQuery 12:")
print(result12)

# Display all details from both tables with the highest gross collection
query13="SELECT * FROM (SELECT * FROM df1 UNION SELECT * FROM df2) WHERE gross_collection=(SELECT MAX(gross_collection) FROM (SELECT * FROM df1 UNION SELECT * FROM df2))"
result13=ps.sqldf(query13)
print("\nQuery 13:")
print(result13)

# Display all details from both tables with the highest ratings
query14="SELECT * FROM (SELECT * FROM df1 UNION SELECT * FROM df2) WHERE ratings=(SELECT MAX(ratings) FROM (SELECT * FROM df1 UNION SELECT * FROM df2))"
result14=ps.sqldf(query14)
print("\nQuery 14:")
print(result14)

# Display all details from both tables with the lowest gross collection and lowest ratings
query15="SELECT * FROM (SELECT * FROM df1 UNION SELECT * FROM df2) WHERE gross_collection=(SELECT MIN(gross_collection) FROM (SELECT * FROM df1 UNION SELECT * FROM df2)) AND ratings=(SELECT MIN(ratings) FROM (SELECT * FROM df1 UNION SELECT * FROM df2))"
result15=ps.sqldf(query15)
print("\nQuery 15:")
print(result15)

# Join Query

In [ ]:
join_query1=pd.merge(df1[df1['director_names'].isin(['Christopher','Matt Reeves'])],df2[df2['director_names'].isin(['Christopher','Matt Reeves'])],on='movie_name',how='inner')
print("Query 1 - Movies created by directors Christopher and Matt Reeves:")
print(join_query1)

join_query2=pd.merge(df1[(df1['duration']>=140) & (df1['duration']<=190)],df2[(df2['duration']>=140) & (df2['duration']<=190)],on='movie_name',how='inner')
print("\nQuery 2 - Movies with a duration of 140 minutes to 190 minutes:")
print(join_query2)

join_query3=pd.merge(df1[df1['ratings']>7],df2[df2['ratings']>7],on='movie_name',how='inner').sort_values(by=['ratings_x','ratings_y'])
print("\nQuery 3 - Movies with ratings above 7 in ascending order:")
print(join_query3)

join_query4=pd.merge(df1[df1['stars_names'].str.contains('Arnold Schwarzenegger')],df2[df2['stars_names'].str.contains('Arnold Schwarzenegger')],on='movie_name',how='inner').sort_values(by='movie_name')
movie_names_with_arnold=join_query4['movie_name']
print("\nQuery 4 - Movie names with star Arnold Schwarzenegger in ascending order:")
print(movie_names_with_arnold)

combined_df=pd.concat([df1,df2])
max_gross_collection=combined_df['gross_collection'].max()
join_query5=combined_df[combined_df['gross_collection']==max_gross_collection]
print("\nQuery 5 - Details of movies with the highest gross collection:")
print(join_query5)